## Terraform Plan

| Step | Status |
|------|--------|
| Format  | ❌ `failure` |
| Init    | ✅ `success` |
| Validate| ✅ `success` |
| Plan    | ✅ `success` |

<details><summary>Plan output</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03ZWRkYTA3Mi00NmFlLTQ3YjItYjgyOS02M2IzOTBlZjI0YmM7b2JqZWN0SWQ9YWU2MDYyOGEtYmRhMC00MTFhLThkOTctZGRlOGRlNzMwOTcyO3N1YnNjcmlwdGlvbklkPWMwZmM4ZDFiLTY4MDYtNGNiYy05YTU3LThmMzZmMWU2MzMxZDt0ZW5hbnRJZD01YWIxZmZiMC05Mjk2LTQxMTktOTZmMS1hNDg5ZjVlY2JhOGU=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_registry.main will be created
  + resource "azurerm_container_registry" "main" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + data_endpoint_host_names      = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + login_server                  = (known after apply)
      + name                          = (known after apply)
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-cloud-native-training"
      + sku                           = "Standard"
      + tags                          = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-native-training"
        }
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # azurerm_key_vault.main will be created
  + resource "azurerm_key_vault" "main" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = (known after apply)
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + rbac_authorization_enabled    = true
      + resource_group_name           = "rg-cloud-native-training"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-native-training"
        }
      + tenant_id                     = "5ab1ffb0-9296-4119-96f1-a489f5ecba8e"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_secret.postgresql_password will be created
  + resource "azurerm_key_vault_secret" "postgresql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "postgresql-admin-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-native-training"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + ai_toolchain_operator_enabled       = false
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = (known after apply)
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.29"
      + location                            = "westeurope"
      + name                                = (known after apply)
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "rg-cloud-native-training"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-native-training"
        }
      + workload_identity_enabled           = true

      + default_node_pool {
          + kubelet_disk_type            = (known after apply)
          + max_pods                     = (known after apply)
          + name                         = "system"
          + node_count                   = 2
          + node_labels                  = (known after apply)
          + only_critical_addons_enabled = true
          + orchestrator_version         = (known after apply)
          + os_disk_size_gb              = (known after apply)
          + os_disk_type                 = "Managed"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_D2s_v3"
          + vnet_subnet_id               = (known after apply)
          + workload_runtime             = (known after apply)

          + upgrade_settings {
              + max_surge = "10%"
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "2m"
        }

      + network_profile {
          + dns_service_ip     = "172.16.0.10"
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "azure"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "172.16.0.0/16"
          + service_cidrs      = (known after apply)
        }

      + service_mesh_profile {
          + external_ingress_gateway_enabled = false
          + internal_ingress_gateway_enabled = true
          + mode                             = "Istio"
          + revisions                        = [
              + "asm-1-22",
            ]
        }
    }

  # azurerm_kubernetes_cluster_node_pool.spot will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "spot" {
      + auto_scaling_enabled  = true
      + eviction_policy       = "Delete"
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 5
      + max_pods              = (known after apply)
      + min_count             = 0
      + mode                  = "User"
      + name                  = "spot"
      + node_count            = (known after apply)
      + node_labels           = {
          + "kubernetes.azure.com/scalesetpriority" = "spot"
        }
      + node_taints           = [
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Spot"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-native-training"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D2s_v3"
      + vnet_subnet_id        = (known after apply)

      + upgrade_settings {
          + max_surge = "10%"
        }
    }

  # azurerm_postgresql_flexible_server.main will be created
  + resource "azurerm_postgresql_flexible_server" "main" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 7
      + delegated_subnet_id           = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = (known after apply)
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-cloud-native-training"
      + sku_name                      = "B_Standard_B2s"
      + storage_mb                    = 32768
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-native-training"
        }
      + version                       = "15"
    }

  # azurerm_postgresql_flexible_server_database.app will be created
  + resource "azurerm_postgresql_flexible_server_database" "app" {
      + charset   = "UTF8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "training_db"
      + server_id = (known after apply)
    }

  # azurerm_postgresql_flexible_server_firewall_rule.aks_subnet will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "aks_subnet" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "allow-aks-subnet"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # azurerm_private_dns_zone.postgresql will be created
  + resource "azurerm_private_dns_zone" "postgresql" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "training.postgres.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-cloud-native-training"
      + tags                                                  = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-native-training"
        }
    }

  # azurerm_private_dns_zone_virtual_network_link.postgresql will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "postgresql" {
      + id                    = (known after apply)
      + name                  = "vnetlink-postgresql"
      + private_dns_zone_name = "training.postgres.database.azure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-cloud-native-training"
      + tags                  = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-native-training"
        }
      + virtual_network_id    = (known after apply)
    }

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-cloud-native-training"
      + tags     = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-native-training"
        }
    }

  # azurerm_role_assignment.aks_acr_pull will be created
  + resource "azurerm_role_assignment" "aks_acr_pull" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.aks_kv_secrets_user will be created
  + resource "azurerm_role_assignment" "aks_kv_secrets_user" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.aks_network_contributor will be created
  + resource "azurerm_role_assignment" "aks_network_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.kv_admin_current_user will be created
  + resource "azurerm_role_assignment" "kv_admin_current_user" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ae60628a-bda0-411a-8d97-dde8de730972"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_subnet.aks will be created
  + resource "azurerm_subnet" "aks" {
      + address_prefixes                              = [
          + "10.240.0.0/16",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-aks"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-cloud-native-training"
      + virtual_network_name                          = "vnet-training"
    }

  # azurerm_subnet.postgresql will be created
  + resource "azurerm_subnet" "postgresql" {
      + address_prefixes                              = [
          + "10.241.0.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-postgresql"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-cloud-native-training"
      + virtual_network_name                          = "vnet-training"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # azurerm_virtual_network.main will be created
  + resource "azurerm_virtual_network" "main" {
      + address_space                  = [
          + "10.0.0.0/8",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "westeurope"
      + name                           = "vnet-training"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-cloud-native-training"
      + subnet                         = (known after apply)
      + tags                           = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-native-training"
        }
    }

  # github_actions_variable.acr_login_server will be created
  + resource "github_actions_variable" "acr_login_server" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "cloud-native-training"
      + repository_id = (known after apply)
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "ACR_LOGIN_SERVER"
    }

  # github_actions_variable.acr_name will be created
  + resource "github_actions_variable" "acr_name" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "cloud-native-training"
      + repository_id = (known after apply)
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "ACR_NAME"
    }

  # github_actions_variable.aks_cluster_name will be created
  + resource "github_actions_variable" "aks_cluster_name" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "cloud-native-training"
      + repository_id = (known after apply)
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "AKS_CLUSTER_NAME"
    }

  # github_actions_variable.aks_resource_group will be created
  + resource "github_actions_variable" "aks_resource_group" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "cloud-native-training"
      + repository_id = (known after apply)
      + updated_at    = (known after apply)
      + value         = "rg-cloud-native-training"
      + variable_name = "AKS_RESOURCE_GROUP"
    }

  # github_actions_variable.azure_tenant_id_var will be created
  + resource "github_actions_variable" "azure_tenant_id_var" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "cloud-native-training"
      + repository_id = (known after apply)
      + updated_at    = (known after apply)
      + value         = "5ab1ffb0-9296-4119-96f1-a489f5ecba8e"
      + variable_name = "AZURE_TENANT_ID_VAR"
    }

  # github_actions_variable.key_vault_name will be created
  + resource "github_actions_variable" "key_vault_name" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "cloud-native-training"
      + repository_id = (known after apply)
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "KEY_VAULT_NAME"
    }

  # github_actions_variable.kv_csi_identity_client_id will be created
  + resource "github_actions_variable" "kv_csi_identity_client_id" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "cloud-native-training"
      + repository_id = (known after apply)
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "KV_CSI_IDENTITY_CLIENT_ID"
    }

  # github_actions_variable.psql_admin_user will be created
  + resource "github_actions_variable" "psql_admin_user" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "cloud-native-training"
      + repository_id = (known after apply)
      + updated_at    = (known after apply)
      + value         = "pgadmin"
      + variable_name = "PSQL_ADMIN_USER"
    }

  # github_actions_variable.psql_db_name will be created
  + resource "github_actions_variable" "psql_db_name" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "cloud-native-training"
      + repository_id = (known after apply)
      + updated_at    = (known after apply)
      + value         = "training_db"
      + variable_name = "PSQL_DB_NAME"
    }

  # github_actions_variable.psql_fqdn will be created
  + resource "github_actions_variable" "psql_fqdn" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "cloud-native-training"
      + repository_id = (known after apply)
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "PSQL_FQDN"
    }

  # random_id.suffix will be created
  + resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_password.postgresql will be created
  + resource "random_password" "postgresql" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 24
      + lower            = true
      + min_lower        = 2
      + min_numeric      = 2
      + min_special      = 2
      + min_upper        = 2
      + number           = true
      + numeric          = true
      + override_special = "!#%&*-_=+?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 30 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acr_login_server                = (known after apply)
  + acr_name                        = (known after apply)
  + aks_cluster_id                  = (known after apply)
  + aks_cluster_name                = (known after apply)
  + aks_oidc_issuer_url             = (known after apply)
  + get_credentials_command         = (known after apply)
  + github_actions_vars             = {
      + ACR_LOGIN_SERVER          = (known after apply)
      + ACR_NAME                  = (known after apply)
      + AKS_CLUSTER_NAME          = (known after apply)
      + AKS_RESOURCE_GROUP        = "rg-cloud-native-training"
      + AZURE_TENANT_ID_VAR       = "5ab1ffb0-9296-4119-96f1-a489f5ecba8e"
      + KEY_VAULT_NAME            = (known after apply)
      + KV_CSI_IDENTITY_CLIENT_ID = (known after apply)
      + PSQL_ADMIN_USER           = "pgadmin"
      + PSQL_DB_NAME              = "training_db"
      + PSQL_FQDN                 = (known after apply)
    }
  + key_vault_name                  = (known after apply)
  + key_vault_uri                   = (known after apply)
  + kv_csi_identity_client_id       = (known after apply)
  + postgresql_admin_username       = "pgadmin"
  + postgresql_database_name        = "training_db"
  + postgresql_fqdn                 = (known after apply)
  + postgresql_password_secret_name = "postgresql-admin-password"
  + resource_group_name             = "rg-cloud-native-training"
Releasing state lock. This may take a few moments...

```
</details>

_Pushed to `main` will automatically apply this plan._